; ModuleID = '__uClibc_main.os'
source_filename = "libc/misc/internals/__uClibc_main.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

module asm ".section .gnu.warning.__fpending"
module asm "\09.previous"

%struct.__uclibc_locale_struct.202 = type { i16*, i16*, i16*, [384 x i16], [384 x i16], [384 x i16], [14 x i8], [6 x i16], [6 x i8], i8, i8, [10 x i8], i8*, i8*, i8*, i8*, i8*, i16*, i8*, i8*, i16*, i8*, i8*, i16*, i32, i32, i32, i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct.__collate_t.201 }
%struct.__collate_t.201 = type { i16, i16, i16, i16, i16, i16, i16, i16, i16, i16, i16, i16, i16, i16, i16, i16, i16*, i16*, i16*, i16*, i16*, i16*, i16*, i16*, i16*, i16 }
%struct.__STDIO_FILE_STRUCT.569 = type { i16, [2 x i8], i32, i8*, i8*, i8*, i8*, i8*, i8*, %struct.__STDIO_FILE_STRUCT.569*, [2 x i32], %struct.__mbstate_t.568, i8* }
%struct.__mbstate_t.568 = type { i32, i32 }
%struct.option = type { i8*, i32, i32*, i32 }
%struct.infomap = type { i8*, i8* }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "__libc_stack_end", scope: !2, file: !3, line: 52, type: !6, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Debian clang version 13.0.1-11+b2", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !5, globals: !26, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "libc/misc/internals/__uClibc_main.c", directory: "/home/aleksandar/Desktop/klee-uclibc")
!4 = !{}
!5 = !{!6, !7, !9, !11, !23, !25}
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!7 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !8, size: 64)
!8 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!9 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !10, size: 64)
!10 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!11 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !12, size: 64)
!12 = !DIDerivedType(tag: DW_TAG_typedef, name: "Elf64_auxv_t", file: !13, line: 1036, baseType: !14)
!13 = !DIFile(filename: "./include/elf.h", directory: "/home/aleksandar/Desktop/klee-uclibc")
!14 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !13, line: 1026, size: 128, elements: !15)
!15 = !{!16, !19}
!16 = !DIDerivedType(tag: DW_TAG_member, name: "a_type", scope: !14, file: !13, line: 1028, baseType: !17, size: 64)
!17 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !18, line: 58, baseType: !10)
!18 = !DIFile(filename: "./include/stdint.h", directory: "/home/aleksandar/Desktop/klee-uclibc")
!19 = !DIDerivedType(tag: DW_TAG_member, name: "a_un", scope: !14, file: !13, line: 1035, baseType: !20, size: 64, offset: 64)
!20 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !14, file: !13, line: 1029, size: 64, elements: !21)
!21 = !{!22}
!22 = !DIDerivedType(tag: DW_TAG_member, name: "a_val", scope: !20, file: !13, line: 1031, baseType: !17, size: 64)
!23 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !24, line: 46, baseType: !10)
!24 = !DIFile(filename: "/usr/lib/llvm-13/lib/clang/13.0.1/include/stddef.h", directory: "")
!25 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!26 = !{!0, !27, !31, !33, !35, !38, !40, !46, !49}
!27 = !DIGlobalVariableExpression(var: !28, expr: !DIExpression())
!28 = distinct !DIGlobalVariable(name: "__uclibc_progname", scope: !2, file: !3, line: 110, type: !29, isLocal: false, isDefinition: true)
!29 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !30, size: 64)
!30 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !8)
!31 = !DIGlobalVariableExpression(var: !32, expr: !DIExpression())
!32 = distinct !DIGlobalVariable(name: "program_invocation_short_name", scope: !2, file: !3, line: 112, type: !29, isLocal: false, isDefinition: true)
!33 = !DIGlobalVariableExpression(var: !34, expr: !DIExpression())
!34 = distinct !DIGlobalVariable(name: "program_invocation_name", scope: !2, file: !3, line: 113, type: !29, isLocal: false, isDefinition: true)
!35 = !DIGlobalVariableExpression(var: !36, expr: !DIExpression())
!36 = distinct !DIGlobalVariable(name: "__environ", scope: !2, file: !3, line: 125, type: !37, isLocal: false, isDefinition: true)
!37 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!38 = !DIGlobalVariableExpression(var: !39, expr: !DIExpression())
!39 = distinct !DIGlobalVariable(name: "__pagesize", scope: !2, file: !3, line: 129, type: !23, isLocal: false, isDefinition: true)
!40 = !DIGlobalVariableExpression(var: !41, expr: !DIExpression())
!41 = distinct !DIGlobalVariable(name: "been_there_done_that", scope: !42, file: !3, line: 189, type: !45, isLocal: true, isDefinition: true)
!42 = distinct !DISubprogram(name: "__uClibc_init", scope: !3, file: !3, line: 187, type: !43, scopeLine: 188, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!43 = !DISubroutineType(types: !44)
!44 = !{null}
!45 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!46 = !DIGlobalVariableExpression(var: !47, expr: !DIExpression())
!47 = distinct !DIGlobalVariable(name: "__app_fini", scope: !2, file: !3, line: 244, type: !48, isLocal: false, isDefinition: true)
!48 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !43, size: 64)
!49 = !DIGlobalVariableExpression(var: !50, expr: !DIExpression())
!50 = distinct !DIGlobalVariable(name: "__rtld_fini", scope: !2, file: !3, line: 247, type: !48, isLocal: false, isDefinition: true)
!51 = !DIGlobalVariableExpression(var: !52, expr: !DIExpression())
!52 = distinct !DIGlobalVariable(name: "n_calls", scope: !53, file: !54, line: 313, type: !45, isLocal: true, isDefinition: true)
!53 = distinct !DISubprogram(name: "close", scope: !54, file: !54, line: 312, type: !55, scopeLine: 312, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !57, retainedNodes: !4)
!54 = !DIFile(filename: "runtime/POSIX/fd.c", directory: "/home/aleksandar/Desktop/klee_project/2023_VLC-Media-Player_KLEE/klee")
!55 = !DISubroutineType(types: !56)
!56 = !{!45, !45}
!57 = distinct !DICompileUnit(language: DW_LANG_C89, file: !58, producer: "Debian clang version 13.0.1-11+b2", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !59, retainedTypes: !80, globals: !139, splitDebugInlining: false, nameTableKind: None)
!58 = !DIFile(filename: "/home/aleksandar/Desktop/klee_project/2023_VLC-Media-Player_KLEE/klee/runtime/POSIX/fd.c", directory: "/home/aleksandar/Desktop/klee_project/2023_VLC-Media-Player_KLEE/klee/build/runtime/POSIX")
!59 = !{!60, !68}
!60 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !61, line: 58, baseType: !62, size: 32, elements: !63)
!61 = !DIFile(filename: "runtime/POSIX/fd.h", directory: "/home/aleksandar/Desktop/klee_project/2023_VLC-Media-Player_KLEE/klee")
!62 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!63 = !{!64, !65, !66, !67}
!64 = !DIEnumerator(name: "eOpen", value: 1)
!65 = !DIEnumerator(name: "eCloseOnExec", value: 2)
!66 = !DIEnumerator(name: "eReadable", value: 4)
!67 = !DIEnumerator(name: "eWriteable", value: 8)
!68 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !69, line: 97, baseType: !62, size: 32, elements: !70)
!69 = !DIFile(filename: "/usr/include/dirent.h", directory: "")
!70 = !{!71, !72, !73, !74, !75, !76, !77, !78, !79}
!71 = !DIEnumerator(name: "DT_UNKNOWN", value: 0)
!72 = !DIEnumerator(name: "DT_FIFO", value: 1)
!73 = !DIEnumerator(name: "DT_CHR", value: 2)
!74 = !DIEnumerator(name: "DT_DIR", value: 4)
!75 = !DIEnumerator(name: "DT_BLK", value: 6)
!76 = !DIEnumerator(name: "DT_REG", value: 8)
!77 = !DIEnumerator(name: "DT_LNK", value: 10)
!78 = !DIEnumerator(name: "DT_SOCK", value: 12)
!79 = !DIEnumerator(name: "DT_WHT", value: 14)
!80 = !{!81, !6, !82, !10, !86, !7, !101, !45, !8}
!81 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!82 = !DIDerivedType(tag: DW_TAG_typedef, name: "off64_t", file: !83, line: 92, baseType: !84)
!83 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "")
!84 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !85, line: 153, baseType: !81)
!85 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!86 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !87, size: 64)
!87 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dirent64", file: !88, line: 37, size: 2240, elements: !89)
!88 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/dirent.h", directory: "")
!89 = !{!90, !92, !93, !95, !97}
!90 = !DIDerivedType(tag: DW_TAG_member, name: "d_ino", scope: !87, file: !88, line: 39, baseType: !91, size: 64)
!91 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino64_t", file: !85, line: 149, baseType: !10)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "d_off", scope: !87, file: !88, line: 40, baseType: !84, size: 64, offset: 64)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "d_reclen", scope: !87, file: !88, line: 41, baseType: !94, size: 16, offset: 128)
!94 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "d_type", scope: !87, file: !88, line: 42, baseType: !96, size: 8, offset: 144)
!96 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "d_name", scope: !87, file: !88, line: 43, baseType: !98, size: 2048, offset: 152)
!98 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 2048, elements: !99)
!99 = !{!100}
!100 = !DISubrange(count: 256)
!101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !102, size: 64)
!102 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !103, line: 26, size: 1152, elements: !104)
!103 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/struct_stat.h", directory: "")
!104 = !{!105, !107, !109, !111, !113, !115, !117, !118, !119, !121, !123, !125, !133, !134, !135}
!105 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !102, file: !103, line: 31, baseType: !106, size: 64)
!106 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !85, line: 145, baseType: !10)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !102, file: !103, line: 36, baseType: !108, size: 64, offset: 64)
!108 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !85, line: 148, baseType: !10)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !102, file: !103, line: 44, baseType: !110, size: 64, offset: 128)
!110 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !85, line: 151, baseType: !10)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !102, file: !103, line: 45, baseType: !112, size: 32, offset: 192)
!112 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !85, line: 150, baseType: !62)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !102, file: !103, line: 47, baseType: !114, size: 32, offset: 224)
!114 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !85, line: 146, baseType: !62)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !102, file: !103, line: 48, baseType: !116, size: 32, offset: 256)
!116 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !85, line: 147, baseType: !62)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !102, file: !103, line: 50, baseType: !45, size: 32, offset: 288)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !102, file: !103, line: 52, baseType: !106, size: 64, offset: 320)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !102, file: !103, line: 57, baseType: !120, size: 64, offset: 384)
!120 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !85, line: 152, baseType: !81)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !102, file: !103, line: 61, baseType: !122, size: 64, offset: 448)
!122 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !85, line: 175, baseType: !81)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !102, file: !103, line: 63, baseType: !124, size: 64, offset: 512)
!124 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !85, line: 180, baseType: !81)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !102, file: !103, line: 74, baseType: !126, size: 128, offset: 576)
!126 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !127, line: 11, size: 128, elements: !128)
!127 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_timespec.h", directory: "")
!128 = !{!129, !131}
!129 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !126, file: !127, line: 16, baseType: !130, size: 64)
!130 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !85, line: 160, baseType: !81)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !126, file: !127, line: 21, baseType: !132, size: 64, offset: 64)
!132 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !85, line: 197, baseType: !81)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !102, file: !103, line: 75, baseType: !126, size: 128, offset: 704)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !102, file: !103, line: 76, baseType: !126, size: 128, offset: 832)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !102, file: !103, line: 89, baseType: !136, size: 192, offset: 960)
!136 = !DICompositeType(tag: DW_TAG_array_type, baseType: !132, size: 192, elements: !137)
!137 = !{!138}
!138 = !DISubrange(count: 3)
!139 = !{!51, !140, !147, !154, !160, !165, !170}
!140 = !DIGlobalVariableExpression(var: !141, expr: !DIExpression())
!141 = distinct !DIGlobalVariable(name: "n_calls", scope: !142, file: !54, line: 345, type: !45, isLocal: true, isDefinition: true)
!142 = distinct !DISubprogram(name: "read", scope: !54, file: !54, line: 344, type: !143, scopeLine: 344, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !57, retainedNodes: !4)
!143 = !DISubroutineType(types: !144)
!144 = !{!145, !45, !6, !23}
!145 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !83, line: 108, baseType: !146)
!146 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !85, line: 194, baseType: !81)
!147 = !DIGlobalVariableExpression(var: !148, expr: !DIExpression())
!148 = distinct !DIGlobalVariable(name: "n_calls", scope: !149, file: !54, line: 411, type: !45, isLocal: true, isDefinition: true)
!149 = distinct !DISubprogram(name: "write", scope: !54, file: !54, line: 410, type: !150, scopeLine: 410, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !57, retainedNodes: !4)
!150 = !DISubroutineType(types: !151)
!151 = !{!145, !45, !152, !23}
!152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !153, size: 64)
!153 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!154 = !DIGlobalVariableExpression(var: !155, expr: !DIExpression())
!155 = distinct !DIGlobalVariable(name: "n_calls", scope: !156, file: !54, line: 647, type: !45, isLocal: true, isDefinition: true)
!156 = distinct !DISubprogram(name: "chmod", scope: !54, file: !54, line: 646, type: !157, scopeLine: 646, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !57, retainedNodes: !4)
!157 = !DISubroutineType(types: !158)
!158 = !{!45, !29, !159}
!159 = !DIDerivedType(tag: DW_TAG_typedef, name: "mode_t", file: !83, line: 69, baseType: !112)
!160 = !DIGlobalVariableExpression(var: !161, expr: !DIExpression())
!161 = distinct !DIGlobalVariable(name: "n_calls", scope: !162, file: !54, line: 666, type: !45, isLocal: true, isDefinition: true)
!162 = distinct !DISubprogram(name: "fchmod", scope: !54, file: !54, line: 665, type: !163, scopeLine: 665, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !57, retainedNodes: !4)
!163 = !DISubroutineType(types: !164)
!164 = !{!45, !45, !159}
!165 = !DIGlobalVariableExpression(var: !166, expr: !DIExpression())
!166 = distinct !DIGlobalVariable(name: "n_calls", scope: !167, file: !54, line: 752, type: !45, isLocal: true, isDefinition: true)
!167 = distinct !DISubprogram(name: "__fd_ftruncate", scope: !54, file: !54, line: 751, type: !168, scopeLine: 751, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !57, retainedNodes: !4)
!168 = !DISubroutineType(types: !169)
!169 = !{!45, !45, !82}
!170 = !DIGlobalVariableExpression(var: !171, expr: !DIExpression())
!171 = distinct !DIGlobalVariable(name: "n_calls", scope: !172, file: !54, line: 1346, type: !45, isLocal: true, isDefinition: true)
!172 = distinct !DISubprogram(name: "getcwd", scope: !54, file: !54, line: 1345, type: !173, scopeLine: 1345, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !57, retainedNodes: !4)
!173 = !DISubroutineType(types: !174)
!174 = !{!7, !7, !23}
!175 = !DIGlobalVariableExpression(var: !176, expr: !DIExpression())
!176 = distinct !DIGlobalVariable(name: "__global_locale_data", scope: !177, file: !212, line: 375, type: !451, isLocal: false, isDefinition: true)
!177 = distinct !DICompileUnit(language: DW_LANG_C99, file: !178, producer: "Debian clang version 13.0.1-11+b2", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !179, retainedTypes: !201, globals: !254, splitDebugInlining: false, nameTableKind: None)
!178 = !DIFile(filename: "libc/misc/locale/_locale_init.c", directory: "/home/aleksandar/Desktop/klee-uclibc")
!179 = !{!180, !186}
!180 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !181, line: 90, baseType: !62, size: 32, elements: !182)
!181 = !DIFile(filename: "./include/bits/uClibc_locale.h", directory: "/home/aleksandar/Desktop/klee-uclibc")
!182 = !{!183, !184, !185}
!183 = !DIEnumerator(name: "__ctype_encoding_7_bit", value: 0)
!184 = !DIEnumerator(name: "__ctype_encoding_utf8", value: 1)
!185 = !DIEnumerator(name: "__ctype_encoding_8_bit", value: 2)
!186 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !187, line: 48, baseType: !62, size: 32, elements: !188)
!187 = !DIFile(filename: "./include/ctype.h", directory: "/home/aleksandar/Desktop/klee-uclibc")
!188 = !{!189, !190, !191, !192, !193, !194, !195, !196, !197, !198, !199, !200}
!189 = !DIEnumerator(name: "_ISupper", value: 256)
!190 = !DIEnumerator(name: "_ISlower", value: 512)
!191 = !DIEnumerator(name: "_ISalpha", value: 1024)
!192 = !DIEnumerator(name: "_ISdigit", value: 2048)
!193 = !DIEnumerator(name: "_ISxdigit", value: 4096)
!194 = !DIEnumerator(name: "_ISspace", value: 8192)
!195 = !DIEnumerator(name: "_ISprint", value: 16384)
!196 = !DIEnumerator(name: "_ISgraph", value: 32768)
!197 = !DIEnumerator(name: "_ISblank", value: 1)
!198 = !DIEnumerator(name: "_IScntrl", value: 2)
!199 = !DIEnumerator(name: "_ISpunct", value: 4)
!200 = !DIEnumerator(name: "_ISalnum", value: 8)
!201 = !{!45, !202, !7, !203, !205, !208, !96, !209, !210, !223, !231, !10}
!202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !29, size: 64)
!203 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !204, size: 64)
!204 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !96)
!205 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !206, size: 64)
!206 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !207)
!207 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !18, line: 52, baseType: !94)
!208 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !96, size: 64)
!210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !211, size: 64)
!211 = !DIDerivedType(tag: DW_TAG_typedef, name: "coldata_header_t", file: !212, line: 400, baseType: !213)
!212 = !DIFile(filename: "libc/misc/locale/locale.c", directory: "/home/aleksandar/Desktop/klee-uclibc")
!213 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !212, line: 390, size: 128, elements: !214)
!214 = !{!215, !216, !217, !218, !219, !220, !221, !222}
!215 = !DIDerivedType(tag: DW_TAG_member, name: "num_base", scope: !213, file: !212, line: 391, baseType: !207, size: 16)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "num_der", scope: !213, file: !212, line: 392, baseType: !207, size: 16, offset: 16)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "MAX_WEIGHTS", scope: !213, file: !212, line: 393, baseType: !207, size: 16, offset: 32)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "num_index2weight", scope: !213, file: !212, line: 394, baseType: !207, size: 16, offset: 48)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "num_weightstr", scope: !213, file: !212, line: 396, baseType: !207, size: 16, offset: 64)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "num_multistart", scope: !213, file: !212, line: 397, baseType: !207, size: 16, offset: 80)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "num_override", scope: !213, file: !212, line: 398, baseType: !207, size: 16, offset: 96)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "num_ruletable", scope: !213, file: !212, line: 399, baseType: !207, size: 16, offset: 112)
!223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !224, size: 64)
!224 = !DIDerivedType(tag: DW_TAG_typedef, name: "coldata_der_t", file: !212, line: 430, baseType: !225)
!225 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !212, line: 425, size: 64, elements: !226)
!226 = !{!227, !228, !229, !230}
!227 = !DIDerivedType(tag: DW_TAG_member, name: "base_idx", scope: !225, file: !212, line: 426, baseType: !207, size: 16)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "undefined_idx", scope: !225, file: !212, line: 427, baseType: !207, size: 16, offset: 16)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "overrides_offset", scope: !225, file: !212, line: 428, baseType: !207, size: 16, offset: 32)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "multistart_offset", scope: !225, file: !212, line: 429, baseType: !207, size: 16, offset: 48)
!231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !232, size: 64)
!232 = !DIDerivedType(tag: DW_TAG_typedef, name: "coldata_base_t", file: !212, line: 423, baseType: !233)
!233 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !212, line: 402, size: 304, elements: !234)
!234 = !{!235, !236, !237, !238, !239, !240, !241, !242, !243, !244, !245, !246, !247, !248, !249, !250, !251, !252, !253}
!235 = !DIDerivedType(tag: DW_TAG_member, name: "num_weights", scope: !233, file: !212, line: 403, baseType: !207, size: 16)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "num_starters", scope: !233, file: !212, line: 404, baseType: !207, size: 16, offset: 16)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "ii_shift", scope: !233, file: !212, line: 405, baseType: !207, size: 16, offset: 32)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "ti_shift", scope: !233, file: !212, line: 406, baseType: !207, size: 16, offset: 48)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "ii_len", scope: !233, file: !212, line: 407, baseType: !207, size: 16, offset: 64)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "ti_len", scope: !233, file: !212, line: 408, baseType: !207, size: 16, offset: 80)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "max_weight", scope: !233, file: !212, line: 409, baseType: !207, size: 16, offset: 96)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "num_col_base", scope: !233, file: !212, line: 410, baseType: !207, size: 16, offset: 112)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "max_col_index", scope: !233, file: !212, line: 411, baseType: !207, size: 16, offset: 128)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "undefined_idx", scope: !233, file: !212, line: 412, baseType: !207, size: 16, offset: 144)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "range_low", scope: !233, file: !212, line: 413, baseType: !207, size: 16, offset: 160)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "range_count", scope: !233, file: !212, line: 414, baseType: !207, size: 16, offset: 176)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "range_base_weight", scope: !233, file: !212, line: 415, baseType: !207, size: 16, offset: 192)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "range_rule_offset", scope: !233, file: !212, line: 416, baseType: !207, size: 16, offset: 208)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "index2weight_offset", scope: !233, file: !212, line: 418, baseType: !207, size: 16, offset: 224)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "index2ruleidx_offset", scope: !233, file: !212, line: 419, baseType: !207, size: 16, offset: 240)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "multistart_offset", scope: !233, file: !212, line: 420, baseType: !207, size: 16, offset: 256)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "wcs2colidt_offset_low", scope: !233, file: !212, line: 421, baseType: !207, size: 16, offset: 272)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "wcs2colidt_offset_hi", scope: !233, file: !212, line: 422, baseType: !207, size: 16, offset: 288)
!254 = !{!255, !439, !175, !441, !444, !446}
!255 = !DIGlobalVariableExpression(var: !256, expr: !DIExpression())
!256 = distinct !DIGlobalVariable(name: "__global_locale", scope: !177, file: !212, line: 377, type: !257, isLocal: false, isDefinition: true)
!257 = !DIDerivedType(tag: DW_TAG_typedef, name: "__locale_t", file: !181, line: 330, baseType: !258)
!258 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !259, size: 64)
!259 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__uclibc_locale_struct", file: !181, line: 154, size: 26560, elements: !260)
!260 = !{!261, !268, !274, !275, !279, !281, !282, !286, !290, !292, !293, !294, !298, !299, !300, !301, !302, !303, !304, !305, !306, !307, !308, !309, !313, !315, !316, !317, !318, !319, !320, !321, !322, !323, !324, !325, !326, !327, !328, !329, !330, !331, !332, !333, !334, !335, !336, !337, !338, !339, !340, !341, !342, !343, !344, !345, !346, !347, !348, !349, !350, !351, !352, !353, !354, !355, !356, !357, !358, !359, !360, !361, !362, !363, !364, !365, !366, !367, !368, !369, !370, !371, !372, !373, !374, !375, !376, !377, !378, !379, !380, !381, !382, !383, !384, !385, !386, !387, !388, !389, !390, !391, !392, !393, !394, !395, !396, !397, !398, !399, !400, !401, !402, !403, !404, !405, !406, !407, !408}
!261 = !DIDerivedType(tag: DW_TAG_member, name: "__ctype_b", scope: !259, file: !181, line: 156, baseType: !262, size: 64)
!262 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !263, size: 64)
!263 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !264)
!264 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ctype_mask_t", file: !265, line: 38, baseType: !266)
!265 = !DIFile(filename: "./include/bits/uClibc_touplow.h", directory: "/home/aleksandar/Desktop/klee-uclibc")
!266 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !267, line: 44, baseType: !94)
!267 = !DIFile(filename: "./include/bits/types.h", directory: "/home/aleksandar/Desktop/klee-uclibc")
!268 = !DIDerivedType(tag: DW_TAG_member, name: "__ctype_tolower", scope: !259, file: !181, line: 157, baseType: !269, size: 64, offset: 64)
!269 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !270, size: 64)
!270 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !271)
!271 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ctype_touplow_t", file: !265, line: 42, baseType: !272)
!272 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int16_t", file: !267, line: 43, baseType: !273)
!273 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "__ctype_toupper", scope: !259, file: !181, line: 158, baseType: !269, size: 64, offset: 128)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "__ctype_b_data", scope: !259, file: !181, line: 162, baseType: !276, size: 6144, offset: 192)
!276 = !DICompositeType(tag: DW_TAG_array_type, baseType: !264, size: 6144, elements: !277)
!277 = !{!278}
!278 = !DISubrange(count: 384)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "__ctype_tolower_data", scope: !259, file: !181, line: 163, baseType: !280, size: 6144, offset: 6336)
!280 = !DICompositeType(tag: DW_TAG_array_type, baseType: !271, size: 6144, elements: !277)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "__ctype_toupper_data", scope: !259, file: !181, line: 164, baseType: !280, size: 6144, offset: 12480)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "cur_locale", scope: !259, file: !181, line: 168, baseType: !283, size: 112, offset: 18624)
!283 = !DICompositeType(tag: DW_TAG_array_type, baseType: !96, size: 112, elements: !284)
!284 = !{!285}
!285 = !DISubrange(count: 14)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "category_offsets", scope: !259, file: !181, line: 174, baseType: !287, size: 96, offset: 18736)
!287 = !DICompositeType(tag: DW_TAG_array_type, baseType: !207, size: 96, elements: !288)
!288 = !{!289}
!289 = !DISubrange(count: 6)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "category_item_count", scope: !259, file: !181, line: 175, baseType: !291, size: 48, offset: 18832)
!291 = !DICompositeType(tag: DW_TAG_array_type, baseType: !96, size: 48, elements: !288)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "encoding", scope: !259, file: !181, line: 178, baseType: !96, size: 8, offset: 18880)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cur_max", scope: !259, file: !181, line: 179, baseType: !96, size: 8, offset: 18888)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "outdigit_length", scope: !259, file: !181, line: 180, baseType: !295, size: 80, offset: 18896)
!295 = !DICompositeType(tag: DW_TAG_array_type, baseType: !204, size: 80, elements: !296)
!296 = !{!297}
!297 = !DISubrange(count: 10)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "idx8ctype", scope: !259, file: !181, line: 183, baseType: !203, size: 64, offset: 19008)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "tbl8ctype", scope: !259, file: !181, line: 184, baseType: !203, size: 64, offset: 19072)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "idx8uplow", scope: !259, file: !181, line: 185, baseType: !203, size: 64, offset: 19136)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "tbl8uplow", scope: !259, file: !181, line: 186, baseType: !203, size: 64, offset: 19200)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "idx8c2wc", scope: !259, file: !181, line: 188, baseType: !203, size: 64, offset: 19264)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "tbl8c2wc", scope: !259, file: !181, line: 189, baseType: !205, size: 64, offset: 19328)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "idx8wc2c", scope: !259, file: !181, line: 190, baseType: !203, size: 64, offset: 19392)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "tbl8wc2c", scope: !259, file: !181, line: 191, baseType: !203, size: 64, offset: 19456)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "code2flag", scope: !259, file: !181, line: 197, baseType: !205, size: 64, offset: 19520)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "tblwctype", scope: !259, file: !181, line: 199, baseType: !203, size: 64, offset: 19584)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "tblwuplow", scope: !259, file: !181, line: 200, baseType: !203, size: 64, offset: 19648)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "tblwuplow_diff", scope: !259, file: !181, line: 202, baseType: !310, size: 64, offset: 19712)
!310 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !311, size: 64)
!311 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !312)
!312 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !18, line: 40, baseType: !273)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "decimal_point_wc", scope: !259, file: !181, line: 205, baseType: !314, size: 32, offset: 19776)
!314 = !DIDerivedType(tag: DW_TAG_typedef, name: "wchar_t", file: !24, line: 74, baseType: !45)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "thousands_sep_wc", scope: !259, file: !181, line: 206, baseType: !314, size: 32, offset: 19808)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "decimal_point_len", scope: !259, file: !181, line: 207, baseType: !45, size: 32, offset: 19840)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "thousands_sep_len", scope: !259, file: !181, line: 208, baseType: !45, size: 32, offset: 19872)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "outdigit0_mb", scope: !259, file: !181, line: 213, baseType: !29, size: 64, offset: 19904)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "outdigit1_mb", scope: !259, file: !181, line: 214, baseType: !29, size: 64, offset: 19968)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "outdigit2_mb", scope: !259, file: !181, line: 215, baseType: !29, size: 64, offset: 20032)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "outdigit3_mb", scope: !259, file: !181, line: 216, baseType: !29, size: 64, offset: 20096)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "outdigit4_mb", scope: !259, file: !181, line: 217, baseType: !29, size: 64, offset: 20160)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "outdigit5_mb", scope: !259, file: !181, line: 218, baseType: !29, size: 64, offset: 20224)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "outdigit6_mb", scope: !259, file: !181, line: 219, baseType: !29, size: 64, offset: 20288)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "outdigit7_mb", scope: !259, file: !181, line: 220, baseType: !29, size: 64, offset: 20352)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "outdigit8_mb", scope: !259, file: !181, line: 221, baseType: !29, size: 64, offset: 20416)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "outdigit9_mb", scope: !259, file: !181, line: 222, baseType: !29, size: 64, offset: 20480)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "codeset", scope: !259, file: !181, line: 223, baseType: !29, size: 64, offset: 20544)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "decimal_point", scope: !259, file: !181, line: 226, baseType: !29, size: 64, offset: 20608)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "thousands_sep", scope: !259, file: !181, line: 227, baseType: !29, size: 64, offset: 20672)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "grouping", scope: !259, file: !181, line: 228, baseType: !29, size: 64, offset: 20736)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "int_curr_symbol", scope: !259, file: !181, line: 231, baseType: !29, size: 64, offset: 20800)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "currency_symbol", scope: !259, file: !181, line: 232, baseType: !29, size: 64, offset: 20864)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "mon_decimal_point", scope: !259, file: !181, line: 233, baseType: !29, size: 64, offset: 20928)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "mon_thousands_sep", scope: !259, file: !181, line: 234, baseType: !29, size: 64, offset: 20992)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "mon_grouping", scope: !259, file: !181, line: 235, baseType: !29, size: 64, offset: 21056)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "positive_sign", scope: !259, file: !181, line: 236, baseType: !29, size: 64, offset: 21120)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "negative_sign", scope: !259, file: !181, line: 237, baseType: !29, size: 64, offset: 21184)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "int_frac_digits", scope: !259, file: !181, line: 238, baseType: !29, size: 64, offset: 21248)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "frac_digits", scope: !259, file: !181, line: 239, baseType: !29, size: 64, offset: 21312)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "p_cs_precedes", scope: !259, file: !181, line: 240, baseType: !29, size: 64, offset: 21376)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "p_sep_by_space", scope: !259, file: !181, line: 241, baseType: !29, size: 64, offset: 21440)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "n_cs_precedes", scope: !259, file: !181, line: 242, baseType: !29, size: 64, offset: 21504)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "n_sep_by_space", scope: !259, file: !181, line: 243, baseType: !29, size: 64, offset: 21568)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "p_sign_posn", scope: !259, file: !181, line: 244, baseType: !29, size: 64, offset: 21632)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "n_sign_posn", scope: !259, file: !181, line: 245, baseType: !29, size: 64, offset: 21696)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "int_p_cs_precedes", scope: !259, file: !181, line: 246, baseType: !29, size: 64, offset: 21760)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "int_p_sep_by_space", scope: !259, file: !181, line: 247, baseType: !29, size: 64, offset: 21824)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "int_n_cs_precedes", scope: !259, file: !181, line: 248, baseType: !29, size: 64, offset: 21888)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "int_n_sep_by_space", scope: !259, file: !181, line: 249, baseType: !29, size: 64, offset: 21952)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "int_p_sign_posn", scope: !259, file: !181, line: 250, baseType: !29, size: 64, offset: 22016)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "int_n_sign_posn", scope: !259, file: !181, line: 251, baseType: !29, size: 64, offset: 22080)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "crncystr", scope: !259, file: !181, line: 253, baseType: !29, size: 64, offset: 22144)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "abday_1", scope: !259, file: !181, line: 256, baseType: !29, size: 64, offset: 22208)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "abday_2", scope: !259, file: !181, line: 257, baseType: !29, size: 64, offset: 22272)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "abday_3", scope: !259, file: !181, line: 258, baseType: !29, size: 64, offset: 22336)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "abday_4", scope: !259, file: !181, line: 259, baseType: !29, size: 64, offset: 22400)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "abday_5", scope: !259, file: !181, line: 260, baseType: !29, size: 64, offset: 22464)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "abday_6", scope: !259, file: !181, line: 261, baseType: !29, size: 64, offset: 22528)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "abday_7", scope: !259, file: !181, line: 262, baseType: !29, size: 64, offset: 22592)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "day_1", scope: !259, file: !181, line: 264, baseType: !29, size: 64, offset: 22656)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "day_2", scope: !259, file: !181, line: 265, baseType: !29, size: 64, offset: 22720)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "day_3", scope: !259, file: !181, line: 266, baseType: !29, size: 64, offset: 22784)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "day_4", scope: !259, file: !181, line: 267, baseType: !29, size: 64, offset: 22848)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "day_5", scope: !259, file: !181, line: 268, baseType: !29, size: 64, offset: 22912)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "day_6", scope: !259, file: !181, line: 269, baseType: !29, size: 64, offset: 22976)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "day_7", scope: !259, file: !181, line: 270, baseType: !29, size: 64, offset: 23040)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "abmon_1", scope: !259, file: !181, line: 272, baseType: !29, size: 64, offset: 23104)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "abmon_2", scope: !259, file: !181, line: 273, baseType: !29, size: 64, offset: 23168)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "abmon_3", scope: !259, file: !181, line: 274, baseType: !29, size: 64, offset: 23232)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "abmon_4", scope: !259, file: !181, line: 275, baseType: !29, size: 64, offset: 23296)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "abmon_5", scope: !259, file: !181, line: 276, baseType: !29, size: 64, offset: 23360)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "abmon_6", scope: !259, file: !181, line: 277, baseType: !29, size: 64, offset: 23424)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "abmon_7", scope: !259, file: !181, line: 278, baseType: !29, size: 64, offset: 23488)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "abmon_8", scope: !259, file: !181, line: 279, baseType: !29, size: 64, offset: 23552)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "abmon_9", scope: !259, file: !181, line: 280, baseType: !29, size: 64, offset: 23616)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "abmon_10", scope: !259, file: !181, line: 281, baseType: !29, size: 64, offset: 23680)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "abmon_11", scope: !259, file: !181, line: 282, baseType: !29, size: 64, offset: 23744)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "abmon_12", scope: !259, file: !181, line: 283, baseType: !29, size: 64, offset: 23808)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "mon_1", scope: !259, file: !181, line: 285, baseType: !29, size: 64, offset: 23872)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "mon_2", scope: !259, file: !181, line: 286, baseType: !29, size: 64, offset: 23936)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "mon_3", scope: !259, file: !181, line: 287, baseType: !29, size: 64, offset: 24000)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "mon_4", scope: !259, file: !181, line: 288, baseType: !29, size: 64, offset: 24064)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "mon_5", scope: !259, file: !181, line: 289, baseType: !29, size: 64, offset: 24128)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "mon_6", scope: !259, file: !181, line: 290, baseType: !29, size: 64, offset: 24192)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "mon_7", scope: !259, file: !181, line: 291, baseType: !29, size: 64, offset: 24256)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "mon_8", scope: !259, file: !181, line: 292, baseType: !29, size: 64, offset: 24320)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "mon_9", scope: !259, file: !181, line: 293, baseType: !29, size: 64, offset: 24384)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "mon_10", scope: !259, file: !181, line: 294, baseType: !29, size: 64, offset: 24448)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "mon_11", scope: !259, file: !181, line: 295, baseType: !29, size: 64, offset: 24512)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "mon_12", scope: !259, file: !181, line: 296, baseType: !29, size: 64, offset: 24576)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "am_str", scope: !259, file: !181, line: 298, baseType: !29, size: 64, offset: 24640)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "pm_str", scope: !259, file: !181, line: 299, baseType: !29, size: 64, offset: 24704)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "d_t_fmt", scope: !259, file: !181, line: 301, baseType: !29, size: 64, offset: 24768)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "d_fmt", scope: !259, file: !181, line: 302, baseType: !29, size: 64, offset: 24832)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "t_fmt", scope: !259, file: !181, line: 303, baseType: !29, size: 64, offset: 24896)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "t_fmt_ampm", scope: !259, file: !181, line: 304, baseType: !29, size: 64, offset: 24960)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "era", scope: !259, file: !181, line: 305, baseType: !29, size: 64, offset: 25024)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "era_year", scope: !259, file: !181, line: 307, baseType: !29, size: 64, offset: 25088)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "era_d_fmt", scope: !259, file: !181, line: 308, baseType: !29, size: 64, offset: 25152)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "alt_digits", scope: !259, file: !181, line: 309, baseType: !29, size: 64, offset: 25216)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "era_d_t_fmt", scope: !259, file: !181, line: 310, baseType: !29, size: 64, offset: 25280)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "era_t_fmt", scope: !259, file: !181, line: 311, baseType: !29, size: 64, offset: 25344)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "yesexpr", scope: !259, file: !181, line: 316, baseType: !29, size: 64, offset: 25408)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "noexpr", scope: !259, file: !181, line: 317, baseType: !29, size: 64, offset: 25472)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "yesstr", scope: !259, file: !181, line: 318, baseType: !29, size: 64, offset: 25536)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "nostr", scope: !259, file: !181, line: 319, baseType: !29, size: 64, offset: 25600)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "collate", scope: !259, file: !181, line: 322, baseType: !409, size: 896, offset: 25664)
!409 = !DIDerivedType(tag: DW_TAG_typedef, name: "__collate_t", file: !181, line: 149, baseType: !410)
!410 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !181, line: 111, size: 896, elements: !411)
!411 = !{!412, !413, !414, !415, !416, !417, !418, !419, !420, !421, !422, !423, !424, !425, !426, !427, !428, !429, !430, !431, !432, !433, !434, !435, !437, !438}
!412 = !DIDerivedType(tag: DW_TAG_member, name: "num_weights", scope: !410, file: !181, line: 112, baseType: !207, size: 16)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "num_starters", scope: !410, file: !181, line: 113, baseType: !207, size: 16, offset: 16)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "ii_shift", scope: !410, file: !181, line: 114, baseType: !207, size: 16, offset: 32)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "ti_shift", scope: !410, file: !181, line: 115, baseType: !207, size: 16, offset: 48)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "ii_len", scope: !410, file: !181, line: 116, baseType: !207, size: 16, offset: 64)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "ti_len", scope: !410, file: !181, line: 117, baseType: !207, size: 16, offset: 80)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "max_weight", scope: !410, file: !181, line: 118, baseType: !207, size: 16, offset: 96)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "num_col_base", scope: !410, file: !181, line: 119, baseType: !207, size: 16, offset: 112)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "max_col_index", scope: !410, file: !181, line: 120, baseType: !207, size: 16, offset: 128)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "undefined_idx", scope: !410, file: !181, line: 121, baseType: !207, size: 16, offset: 144)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "range_low", scope: !410, file: !181, line: 122, baseType: !207, size: 16, offset: 160)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "range_count", scope: !410, file: !181, line: 123, baseType: !207, size: 16, offset: 176)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "range_base_weight", scope: !410, file: !181, line: 124, baseType: !207, size: 16, offset: 192)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "range_rule_offset", scope: !410, file: !181, line: 125, baseType: !207, size: 16, offset: 208)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "ii_mask", scope: !410, file: !181, line: 127, baseType: !207, size: 16, offset: 224)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "ti_mask", scope: !410, file: !181, line: 128, baseType: !207, size: 16, offset: 240)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "index2weight_tbl", scope: !410, file: !181, line: 130, baseType: !205, size: 64, offset: 256)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "index2ruleidx_tbl", scope: !410, file: !181, line: 131, baseType: !205, size: 64, offset: 320)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "multistart_tbl", scope: !410, file: !181, line: 132, baseType: !205, size: 64, offset: 384)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "wcs2colidt_tbl", scope: !410, file: !181, line: 135, baseType: !205, size: 64, offset: 448)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "overrides_tbl", scope: !410, file: !181, line: 138, baseType: !205, size: 64, offset: 512)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "weightstr", scope: !410, file: !181, line: 141, baseType: !205, size: 64, offset: 576)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "ruletable", scope: !410, file: !181, line: 142, baseType: !205, size: 64, offset: 640)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "index2weight", scope: !410, file: !181, line: 145, baseType: !436, size: 64, offset: 704)
!436 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !207, size: 64)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "index2ruleidx", scope: !410, file: !181, line: 146, baseType: !436, size: 64, offset: 768)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "MAX_WEIGHTS", scope: !410, file: !181, line: 148, baseType: !207, size: 16, offset: 832)
!439 = !DIGlobalVariableExpression(var: !440, expr: !DIExpression())
!440 = distinct !DIGlobalVariable(name: "__curlocale_var", scope: !177, file: !212, line: 380, type: !257, isLocal: false, isDefinition: true)
!441 = !DIGlobalVariableExpression(var: !442, expr: !DIExpression())
!442 = distinct !DIGlobalVariable(name: "utf8", scope: !177, file: !212, line: 387, type: !443, isLocal: true, isDefinition: true)
!443 = !DICompositeType(tag: DW_TAG_array_type, baseType: !30, size: 48, elements: !288)
!444 = !DIGlobalVariableExpression(var: !445, expr: !DIExpression())
!445 = distinct !DIGlobalVariable(name: "ascii", scope: !177, file: !212, line: 388, type: !443, isLocal: true, isDefinition: true)
!446 = !DIGlobalVariableExpression(var: !447, expr: !DIExpression())
!447 = distinct !DIGlobalVariable(name: "__code2flag", scope: !177, file: !212, line: 854, type: !448, isLocal: true, isDefinition: true)
!448 = !DICompositeType(tag: DW_TAG_array_type, baseType: !206, size: 256, elements: !449)
!449 = !{!450}
!450 = !DISubrange(count: 16)
!451 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uclibc_locale_t", file: !181, line: 324, baseType: !259)
!452 = !DIGlobalVariableExpression(var: !453, expr: !DIExpression())
!453 = distinct !DIGlobalVariable(name: "_stdio_streams", scope: !454, file: !455, line: 131, type: !499, isLocal: true, isDefinition: true)
!454 = distinct !DICompileUnit(language: DW_LANG_C99, file: !455, producer: "Debian clang version 13.0.1-11+b2", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, globals: !456, splitDebugInlining: false, nameTableKind: None)
!455 = !DIFile(filename: "libc/stdio/_stdio.c", directory: "/home/aleksandar/Desktop/klee-uclibc")
!456 = !{!457, !489, !491, !493, !495, !497, !452}
!457 = !DIGlobalVariableExpression(var: !458, expr: !DIExpression())
!458 = distinct !DIGlobalVariable(name: "stdin", scope: !454, file: !455, line: 154, type: !459, isLocal: false, isDefinition: true)
!459 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !460, size: 64)
!460 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !461, line: 46, baseType: !462)
!461 = !DIFile(filename: "./include/stdio.h", directory: "/home/aleksandar/Desktop/klee-uclibc")
!462 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__STDIO_FILE_STRUCT", file: !463, line: 233, size: 704, elements: !464)
!463 = !DIFile(filename: "./include/bits/uClibc_stdio.h", directory: "/home/aleksandar/Desktop/klee-uclibc")
!464 = !{!465, !466, !470, !471, !472, !473, !474, !475, !476, !477, !479, !481, !488}
!465 = !DIDerivedType(tag: DW_TAG_member, name: "__modeflags", scope: !462, file: !463, line: 234, baseType: !94, size: 16)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "__ungot_width", scope: !462, file: !463, line: 237, baseType: !467, size: 16, offset: 16)
!467 = !DICompositeType(tag: DW_TAG_array_type, baseType: !96, size: 16, elements: !468)
!468 = !{!469}
!469 = !DISubrange(count: 2)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "__filedes", scope: !462, file: !463, line: 244, baseType: !45, size: 32, offset: 32)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "__bufstart", scope: !462, file: !463, line: 246, baseType: !209, size: 64, offset: 64)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "__bufend", scope: !462, file: !463, line: 247, baseType: !209, size: 64, offset: 128)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "__bufpos", scope: !462, file: !463, line: 248, baseType: !209, size: 64, offset: 192)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "__bufread", scope: !462, file: !463, line: 249, baseType: !209, size: 64, offset: 256)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "__bufgetc_u", scope: !462, file: !463, line: 252, baseType: !209, size: 64, offset: 320)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "__bufputc_u", scope: !462, file: !463, line: 255, baseType: !209, size: 64, offset: 384)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "__nextopen", scope: !462, file: !463, line: 261, baseType: !478, size: 64, offset: 448)
!478 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !462, size: 64)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "__ungot", scope: !462, file: !463, line: 268, baseType: !480, size: 64, offset: 512)
!480 = !DICompositeType(tag: DW_TAG_array_type, baseType: !314, size: 64, elements: !468)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "__state", scope: !462, file: !463, line: 271, baseType: !482, size: 64, offset: 576)
!482 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !483, line: 85, baseType: !484)
!483 = !DIFile(filename: "./include/wchar.h", directory: "/home/aleksandar/Desktop/klee-uclibc")
!484 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !483, line: 81, size: 64, elements: !485)
!485 = !{!486, !487}
!486 = !DIDerivedType(tag: DW_TAG_member, name: "__mask", scope: !484, file: !483, line: 83, baseType: !314, size: 32)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "__wc", scope: !484, file: !483, line: 84, baseType: !314, size: 32, offset: 32)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "__unused", scope: !462, file: !463, line: 274, baseType: !6, size: 64, offset: 640)
!489 = !DIGlobalVariableExpression(var: !490, expr: !DIExpression())
!490 = distinct !DIGlobalVariable(name: "stdout", scope: !454, file: !455, line: 155, type: !459, isLocal: false, isDefinition: true)
!491 = !DIGlobalVariableExpression(var: !492, expr: !DIExpression())
!492 = distinct !DIGlobalVariable(name: "stderr", scope: !454, file: !455, line: 156, type: !459, isLocal: false, isDefinition: true)
!493 = !DIGlobalVariableExpression(var: !494, expr: !DIExpression())
!494 = distinct !DIGlobalVariable(name: "__stdin", scope: !454, file: !455, line: 159, type: !459, isLocal: false, isDefinition: true)
!495 = !DIGlobalVariableExpression(var: !496, expr: !DIExpression())
!496 = distinct !DIGlobalVariable(name: "__stdout", scope: !454, file: !455, line: 162, type: !459, isLocal: false, isDefinition: true)
!497 = !DIGlobalVariableExpression(var: !498, expr: !DIExpression())
!498 = distinct !DIGlobalVariable(name: "_stdio_openlist", scope: !454, file: !455, line: 180, type: !459, isLocal: false, isDefinition: true)
!499 = !DICompositeType(tag: DW_TAG_array_type, baseType: !460, size: 2112, elements: !137)
!500 = !DIGlobalVariableExpression(var: !501, expr: !DIExpression())
!501 = distinct !DIGlobalVariable(name: "longopts", scope: !502, file: !503, line: 39, type: !543, isLocal: true, isDefinition: true)
!502 = distinct !DICompileUnit(language: DW_LANG_C99, file: !503, producer: "Debian clang version 13.0.1-11+b2", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !504, retainedTypes: !539, globals: !542, splitDebugInlining: false, nameTableKind: None)
!503 = !DIFile(filename: "../src/mkdir.c", directory: "/home/aleksandar/Desktop/klee_project/2023_VLC-Media-Player_KLEE/coreutils/obj-llvm")
!504 = !{!505, !525}
!505 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !507, file: !506, line: 45, baseType: !62, size: 32, elements: !518)
!506 = !DIFile(filename: "../lib/savewd.h", directory: "/home/aleksandar/Desktop/klee_project/2023_VLC-Media-Player_KLEE/coreutils/obj-llvm")
!507 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "savewd", file: !506, line: 42, size: 64, elements: !508)
!508 = !{!509, !510}
!509 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !507, file: !506, line: 72, baseType: !505, size: 32)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !507, file: !506, line: 80, baseType: !511, size: 32, offset: 32)
!511 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !507, file: !506, line: 75, size: 32, elements: !512)
!512 = !{!513, !514, !515}
!513 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !511, file: !506, line: 77, baseType: !45, size: 32)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "errnum", scope: !511, file: !506, line: 78, baseType: !45, size: 32)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "child", scope: !511, file: !506, line: 79, baseType: !516, size: 32)
!516 = !DIDerivedType(tag: DW_TAG_typedef, name: "pid_t", file: !83, line: 97, baseType: !517)
!517 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pid_t", file: !85, line: 154, baseType: !45)
!518 = !{!519, !520, !521, !522, !523, !524}
!519 = !DIEnumerator(name: "INITIAL_STATE", value: 0)
!520 = !DIEnumerator(name: "FD_STATE", value: 1)
!521 = !DIEnumerator(name: "FD_POST_CHDIR_STATE", value: 2)
!522 = !DIEnumerator(name: "FORKING_STATE", value: 3)
!523 = !DIEnumerator(name: "ERROR_STATE", value: 4)
!524 = !DIEnumerator(name: "FINAL_STATE", value: 5)
!525 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !526, line: 42, baseType: !62, size: 32, elements: !527)
!526 = !DIFile(filename: "../lib/quotearg.h", directory: "/home/aleksandar/Desktop/klee_project/2023_VLC-Media-Player_KLEE/coreutils/obj-llvm")
!527 = !{!528, !529, !530, !531, !532, !533, !534, !535, !536, !537, !538}
!528 = !DIEnumerator(name: "literal_quoting_style", value: 0)
!529 = !DIEnumerator(name: "shell_quoting_style", value: 1)
!530 = !DIEnumerator(name: "shell_always_quoting_style", value: 2)
!531 = !DIEnumerator(name: "shell_escape_quoting_style", value: 3)
!532 = !DIEnumerator(name: "shell_escape_always_quoting_style", value: 4)
!533 = !DIEnumerator(name: "c_quoting_style", value: 5)
!534 = !DIEnumerator(name: "c_maybe_quoting_style", value: 6)
!535 = !DIEnumerator(name: "escape_quoting_style", value: 7)
!536 = !DIEnumerator(name: "locale_quoting_style", value: 8)
!537 = !DIEnumerator(name: "clocale_quoting_style", value: 9)
!538 = !DIEnumerator(name: "custom_quoting_style", value: 10)
!539 = !{!29, !7, !6, !540, !541}
!540 = !DIDerivedType(tag: DW_TAG_typedef, name: "uid_t", file: !83, line: 79, baseType: !114)
!541 = !DIDerivedType(tag: DW_TAG_typedef, name: "gid_t", file: !83, line: 64, baseType: !116)
!542 = !{!500}
!543 = !DICompositeType(tag: DW_TAG_array_type, baseType: !544, size: 1792, elements: !553)
!544 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !545)
!545 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !546, line: 50, size: 256, elements: !547)
!546 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/getopt_ext.h", directory: "")
!547 = !{!548, !549, !550, !552}
!548 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !545, file: !546, line: 52, baseType: !29, size: 64)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !545, file: !546, line: 55, baseType: !45, size: 32, offset: 64)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !545, file: !546, line: 56, baseType: !551, size: 64, offset: 128)
!551 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !45, size: 64)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !545, file: !546, line: 57, baseType: !45, size: 32, offset: 192)
!553 = !{!554}
!554 = !DISubrange(count: 7)
!555 = !DIGlobalVariableExpression(var: !556, expr: !DIExpression())
!556 = distinct !DIGlobalVariable(name: "program_name", scope: !557, file: !558, line: 33, type: !29, isLocal: false, isDefinition: true)
!557 = distinct !DICompileUnit(language: DW_LANG_C99, file: !558, producer: "Debian clang version 13.0.1-11+b2", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !559, globals: !560, splitDebugInlining: false, nameTableKind: None)
!558 = !DIFile(filename: "../lib/progname.c", directory: "/home/aleksandar/Desktop/klee_project/2023_VLC-Media-Player_KLEE/coreutils/obj-llvm")
!559 = !{!6, !7}
!560 = !{!555}
!561 = !DIGlobalVariableExpression(var: !562, expr: !DIExpression())
!562 = distinct !DIGlobalVariable(name: "slot0", scope: !563, file: !564, line: 837, type: !98, isLocal: true, isDefinition: true)
!563 = distinct !DICompileUnit(language: DW_LANG_C99, file: !564, producer: "Debian clang version 13.0.1-11+b2", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !565, retainedTypes: !573, globals: !574, splitDebugInlining: false, nameTableKind: None)
!564 = !DIFile(filename: "../lib/quotearg.c", directory: "/home/aleksandar/Desktop/klee_project/2023_VLC-Media-Player_KLEE/coreutils/obj-llvm")
!565 = !{!525, !566, !571}
!566 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !526, line: 254, baseType: !62, size: 32, elements: !567)
!567 = !{!568, !569, !570}
!568 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1)
!569 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2)
!570 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4)
!571 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !572, line: 46, baseType: !62, size: 32, elements: !188)
!572 = !DIFile(filename: "/usr/include/ctype.h", directory: "")
!573 = !{!45, !94, !23, !29}
!574 = !{!575, !581, !585, !597, !561, !599, !606, !608}
!575 = !DIGlobalVariableExpression(var: !576, expr: !DIExpression())
!576 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !563, file: !564, line: 77, type: !577, isLocal: false, isDefinition: true)
!577 = !DICompositeType(tag: DW_TAG_array_type, baseType: !578, size: 704, elements: !579)
!578 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !29)
!579 = !{!580}
!580 = !DISubrange(count: 11)
!581 = !DIGlobalVariableExpression(var: !582, expr: !DIExpression())
!582 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !563, file: !564, line: 93, type: !583, isLocal: false, isDefinition: true)
!583 = !DICompositeType(tag: DW_TAG_array_type, baseType: !584, size: 320, elements: !296)
!584 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !525)
!585 = !DIGlobalVariableExpression(var: !586, expr: !DIExpression())
!586 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !563, file: !564, line: 1047, type: !587, isLocal: false, isDefinition: true)
!587 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !564, line: 57, size: 448, elements: !588)
!588 = !{!589, !590, !591, !595, !596}
!589 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !587, file: !564, line: 60, baseType: !525, size: 32)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !587, file: !564, line: 63, baseType: !45, size: 32, offset: 32)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !587, file: !564, line: 67, baseType: !592, size: 256, offset: 64)
!592 = !DICompositeType(tag: DW_TAG_array_type, baseType: !62, size: 256, elements: !593)
!593 = !{!594}
!594 = !DISubrange(count: 8)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !587, file: !564, line: 70, baseType: !29, size: 64, offset: 320)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !587, file: !564, line: 73, baseType: !29, size: 64, offset: 384)
!597 = !DIGlobalVariableExpression(var: !598, expr: !DIExpression())
!598 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !563, file: !564, line: 108, type: !587, isLocal: true, isDefinition: true)
!599 = !DIGlobalVariableExpression(var: !600, expr: !DIExpression())
!600 = distinct !DIGlobalVariable(name: "slotvec", scope: !563, file: !564, line: 840, type: !601, isLocal: true, isDefinition: true)
!601 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !602, size: 64)
!602 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !564, line: 829, size: 128, elements: !603)
!603 = !{!604, !605}
!604 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !602, file: !564, line: 831, baseType: !23, size: 64)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !602, file: !564, line: 832, baseType: !7, size: 64, offset: 64)
!606 = !DIGlobalVariableExpression(var: !607, expr: !DIExpression())
!607 = distinct !DIGlobalVariable(name: "nslots", scope: !563, file: !564, line: 838, type: !45, isLocal: true, isDefinition: true)
!608 = !DIGlobalVariableExpression(var: !609, expr: !DIExpression())
!609 = distinct !DIGlobalVariable(name: "slotvec0", scope: !563, file: !564, line: 839, type: !602, isLocal: true, isDefinition: true)
!610 = !DIGlobalVariableExpression(var: !611, expr: !DIExpression())
!611 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !612, file: !613, line: 26, type: !615, isLocal: false, isDefinition: true)
!612 = distinct !DICompileUnit(language: DW_LANG_C99, file: !613, producer: "Debian clang version 13.0.1-11+b2", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, globals: !614, splitDebugInlining: false, nameTableKind: None)
!613 = !DIFile(filename: "../lib/version-etc-fsf.c", directory: "/home/aleksandar/Desktop/klee_project/2023_VLC-Media-Player_KLEE/coreutils/obj-llvm")
!614 = !{!610}
!615 = !DICompositeType(tag: DW_TAG_array_type, baseType: !30, size: 376, elements: !616)
!616 = !{!617}
!617 = !DISubrange(count: 47)
!618 = !DIGlobalVariableExpression(var: !619, expr: !DIExpression())
!619 = distinct !DIGlobalVariable(name: "exit_failure", scope: !620, file: !621, line: 24, type: !623, isLocal: false, isDefinition: true)
!620 = distinct !DICompileUnit(language: DW_LANG_C99, file: !621, producer: "Debian clang version 13.0.1-11+b2", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, globals: !622, splitDebugInlining: false, nameTableKind: None)
!621 = !DIFile(filename: "../lib/exitfail.c", directory: "/home/aleksandar/Desktop/klee_project/2023_VLC-Media-Player_KLEE/coreutils/obj-llvm")
!622 = !{!618}
!623 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !45)
!624 = !DIGlobalVariableExpression(var: !625, expr: !DIExpression())
!625 = distinct !DIGlobalVariable(name: "internal_state", scope: !626, file: !627, line: 97, type: !630, isLocal: true, isDefinition: true)
!626 = distinct !DICompileUnit(language: DW_LANG_C99, file: !627, producer: "Debian clang version 13.0.1-11+b2", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !628, globals: !629, splitDebugInlining: false, nameTableKind: None)
!627 = !DIFile(filename: "../lib/mbrtoc32.c", directory: "/home/aleksandar/Desktop/klee_project/2023_VLC-Media-Player_KLEE/coreutils/obj-llvm")
!628 = !{!6, !23, !96}
!629 = !{!624}
!630 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !631, line: 6, baseType: !632)
!631 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/mbstate_t.h", directory: "")
!632 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !633, line: 21, baseType: !634)
!633 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/__mbstate_t.h", directory: "")
!634 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !633, line: 13, size: 64, elements: !635)
!635 = !{!636, !637}
!636 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !634, file: !633, line: 15, baseType: !45, size: 32)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !634, file: !633, line: 20, baseType: !638, size: 32, offset: 32)
!638 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !634, file: !633, line: 16, size: 32, elements: !639)
!639 = !{!640, !641}
!640 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !638, file: !633, line: 18, baseType: !62, size: 32)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !638, file: !633, line: 19, baseType: !642, size: 32)
!642 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 32, elements: !643)
!643 = !{!644}
!644 = !DISubrange(count: 4)
!645 = !DIGlobalVariableExpression(var: !646, expr: !DIExpression())
!646 = distinct !DIGlobalVariable(name: "posix", scope: !647, file: !212, line: 1093, type: !443, isLocal: true, isDefinition: true)
!647 = distinct !DICompileUnit(language: DW_LANG_C99, file: !648, producer: "Debian clang version 13.0.1-11+b2", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !649, globals: !650, splitDebugInlining: false, nameTableKind: None)
!648 = !DIFile(filename: "libc/misc/locale/newlocale.c", directory: "/home/aleksandar/Desktop/klee-uclibc")
!649 = !{!62, !7, !6, !23, !209, !45}
!650 = !{!651, !645, !809}
!651 = !DIGlobalVariableExpression(var: !652, expr: !DIExpression())
!652 = distinct !DIGlobalVariable(name: "envstr", scope: !653, file: !212, line: 1269, type: !808, isLocal: true, isDefinition: true)
!653 = distinct !DISubprogram(name: "newlocale", scope: !212, file: !212, line: 1243, type: !654, scopeLine: 1244, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !647, retainedNodes: !4)
!654 = !DISubroutineType(types: !655)
!655 = !{!656, !45, !29, !656}
!656 = !DIDerivedType(tag: DW_TAG_typedef, name: "__locale_t", file: !181, line: 330, baseType: !657)
!657 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !658, size: 64)
!658 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__uclibc_locale_struct", file: !181, line: 154, size: 26560, elements: !659)
!659 = !{!660, !661, !662, !663, !664, !665, !666, !667, !668, !669, !670, !671, !672, !673, !674, !675, !676, !677, !678, !679, !680, !681, !682, !683, !684, !685, !686, !687, !688, !689, !690, !691, !692, !693, !694, !695, !696, !697, !698, !699, !700, !701, !702, !703, !704, !705, !706, !707, !708, !709, !710, !711, !712, !713, !714, !715, !716, !717, !718, !719, !720, !721, !722, !723, !724, !725, !726, !727, !728, !729, !730, !731, !732, !733, !734, !735, !736, !737, !738, !739, !740, !741, !742, !743, !744, !745, !746, !747, !748, !749, !750, !751, !752, !753, !754, !755, !756, !757, !758, !759, !760, !761, !762, !763, !764, !765, !766, !767, !768, !769, !770, !771, !772, !773, !774, !775, !776, !777, !778}
!660 = !DIDerivedType(tag: DW_TAG_member, name: "__ctype_b", scope: !658, file: !181, line: 156, baseType: !262, size: 64)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "__ctype_tolower", scope: !658, file: !181, line: 157, baseType: !269, size: 64, offset: 64)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "__ctype_toupper", scope: !658, file: !181, line: 158, baseType: !269, size: 64, offset: 128)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "__ctype_b_data", scope: !658, file: !181, line: 162, baseType: !276, size: 6144, offset: 192)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "__ctype_tolower_data", scope: !658, file: !181, line: 163, baseType: !280, size: 6144, offset: 6336)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "__ctype_toupper_data", scope: !658, file: !181, line: 164, baseType: !280, size: 6144, offset: 12480)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "cur_locale", scope: !658, file: !181, line: 168, baseType: !283, size: 112, offset: 18624)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "category_offsets", scope: !658, file: !181, line: 174, baseType: !287, size: 96, offset: 18736)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "category_item_count", scope: !658, file: !181, line: 175, baseType: !291, size: 48, offset: 18832)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "encoding", scope: !658, file: !181, line: 178, baseType: !96, size: 8, offset: 18880)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cur_max", scope: !658, file: !181, line: 179, baseType: !96, size: 8, offset: 18888)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "outdigit_length", scope: !658, file: !181, line: 180, baseType: !295, size: 80, offset: 18896)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "idx8ctype", scope: !658, file: !181, line: 183, baseType: !203, size: 64, offset: 19008)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "tbl8ctype", scope: !658, file: !181, line: 184, baseType: !203, size: 64, offset: 19072)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "idx8uplow", scope: !658, file: !181, line: 185, baseType: !203, size: 64, offset: 19136)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "tbl8uplow", scope: !658, file: !181, line: 186, baseType: !203, size: 64, offset: 19200)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "idx8c2wc", scope: !658, file: !181, line: 188, baseType: !203, size: 64, offset: 19264)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "tbl8c2wc", scope: !658, file: !181, line: 189, baseType: !205, size: 64, offset: 19328)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "idx8wc2c", scope: !658, file: !181, line: 190, baseType: !203, size: 64, offset: 19392)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "tbl8wc2c", scope: !658, file: !181, line: 191, baseType: !203, size: 64, offset: 19456)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "code2flag", scope: !658, file: !181, line: 197, baseType: !205, size: 64, offset: 19520)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "tblwctype", scope: !658, file: !181, line: 199, baseType: !203, size: 64, offset: 19584)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "tblwuplow", scope: !658, file: !181, line: 200, baseType: !203, size: 64, offset: 19648)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "tblwuplow_diff", scope: !658, file: !181, line: 202, baseType: !310, size: 64, offset: 19712)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "decimal_point_wc", scope: !658, file: !181, line: 205, baseType: !314, size: 32, offset: 19776)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "thousands_sep_wc", scope: !658, file: !181, line: 206, baseType: !314, size: 32, offset: 19808)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "decimal_point_len", scope: !658, file: !181, line: 207, baseType: !45, size: 32, offset: 19840)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "thousands_sep_len", scope: !658, file: !181, line: 208, baseType: !45, size: 32, offset: 19872)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "outdigit0_mb", scope: !658, file: !181, line: 213, baseType: !29, size: 64, offset: 19904)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "outdigit1_mb", scope: !658, file: !181, line: 214, baseType: !29, size: 64, offset: 19968)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "outdigit2_mb", scope: !658, file: !181, line: 215, baseType: !29, size: 64, offset: 20032)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "outdigit3_mb", scope: !658, file: !181, line: 216, baseType: !29, size: 64, offset: 20096)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "outdigit4_mb", scope: !658, file: !181, line: 217, baseType: !29, size: 64, offset: 20160)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "outdigit5_mb", scope: !658, file: !181, line: 218, baseType: !29, size: 64, offset: 20224)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "outdigit6_mb", scope: !658, file: !181, line: 219, baseType: !29, size: 64, offset: 20288)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "outdigit7_mb", scope: !658, file: !181, line: 220, baseType: !29, size: 64, offset: 20352)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "outdigit8_mb", scope: !658, file: !181, line: 221, baseType: !29, size: 64, offset: 20416)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "outdigit9_mb", scope: !658, file: !181, line: 222, baseType: !29, size: 64, offset: 20480)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "codeset", scope: !658, file: !181, line: 223, baseType: !29, size: 64, offset: 20544)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "decimal_point", scope: !658, file: !181, line: 226, baseType: !29, size: 64, offset: 20608)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "thousands_sep", scope: !658, file: !181, line: 227, baseType: !29, size: 64, offset: 20672)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "grouping", scope: !658, file: !181, line: 228, baseType: !29, size: 64, offset: 20736)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "int_curr_symbol", scope: !658, file: !181, line: 231, baseType: !29, size: 64, offset: 20800)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "currency_symbol", scope: !658, file: !181, line: 232, baseType: !29, size: 64, offset: 20864)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "mon_decimal_point", scope: !658, file: !181, line: 233, baseType: !29, size: 64, offset: 20928)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "mon_thousands_sep", scope: !658, file: !181, line: 234, baseType: !29, size: 64, offset: 20992)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "mon_grouping", scope: !658, file: !181, line: 235, baseType: !29, size: 64, offset: 21056)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "positive_sign", scope: !658, file: !181, line: 236, baseType: !29, size: 64, offset: 21120)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "negative_sign", scope: !658, file: !181, line: 237, baseType: !29, size: 64, offset: 21184)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "int_frac_digits", scope: !658, file: !181, line: 238, baseType: !29, size: 64, offset: 21248)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "frac_digits", scope: !658, file: !181, line: 239, baseType: !29, size: 64, offset: 21312)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "p_cs_precedes", scope: !658, file: !181, line: 240, baseType: !29, size: 64, offset: 21376)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "p_sep_by_space", scope: !658, file: !181, line: 241, baseType: !29, size: 64, offset: 21440)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "n_cs_precedes", scope: !658, file: !181, line: 242, baseType: !29, size: 64, offset: 21504)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "n_sep_by_space", scope: !658, file: !181, line: 243, baseType: !29, size: 64, offset: 21568)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "p_sign_posn", scope: !658, file: !181, line: 244, baseType: !29, size: 64, offset: 21632)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "n_sign_posn", scope: !658, file: !181, line: 245, baseType: !29, size: 64, offset: 21696)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "int_p_cs_precedes", scope: !658, file: !181, line: 246, baseType: !29, size: 64, offset: 21760)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "int_p_sep_by_space", scope: !658, file: !181, line: 247, baseType: !29, size: 64, offset: 21824)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "int_n_cs_precedes", scope: !658, file: !181, line: 248, baseType: !29, size: 64, offset: 21888)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "int_n_sep_by_space", scope: !658, file: !181, line: 249, baseType: !29, size: 64, offset: 21952)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "int_p_sign_posn", scope: !658, file: !181, line: 250, baseType: !29, size: 64, offset: 22016)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "int_n_sign_posn", scope: !658, file: !181, line: 251, baseType: !29, size: 64, offset: 22080)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "crncystr", scope: !658, file: !181, line: 253, baseType: !29, size: 64, offset: 22144)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "abday_1", scope: !658, file: !181, line: 256, baseType: !29, size: 64, offset: 22208)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "abday_2", scope: !658, file: !181, line: 257, baseType: !29, size: 64, offset: 22272)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "abday_3", scope: !658, file: !181, line: 258, baseType: !29, size: 64, offset: 22336)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "abday_4", scope: !658, file: !181, line: 259, baseType: !29, size: 64, offset: 22400)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "abday_5", scope: !658, file: !181, line: 260, baseType: !29, size: 64, offset: 22464)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "abday_6", scope: !658, file: !181, line: 261, baseType: !29, size: 64, offset: 22528)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "abday_7", scope: !658, file: !181, line: 262, baseType: !29, size: 64, offset: 22592)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "day_1", scope: !658, file: !181, line: 264, baseType: !29, size: 64, offset: 22656)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "day_2", scope: !658, file: !181, line: 265, baseType: !29, size: 64, offset: 22720)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "day_3", scope: !658, file: !181, line: 266, baseType: !29, size: 64, offset: 22784)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "day_4", scope: !658, file: !181, line: 267, baseType: !29, size: 64, offset: 22848)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "day_5", scope: !658, file: !181, line: 268, baseType: !29, size: 64, offset: 22912)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "day_6", scope: !658, file: !181, line: 269, baseType: !29, size: 64, offset: 22976)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "day_7", scope: !658, file: !181, line: 270, baseType: !29, size: 64, offset: 23040)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "abmon_1", scope: !658, file: !181, line: 272, baseType: !29, size: 64, offset: 23104)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "abmon_2", scope: !658, file: !181, line: 273, baseType: !29, size: 64, offset: 23168)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "abmon_3", scope: !658, file: !181, line: 274, baseType: !29, size: 64, offset: 23232)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "abmon_4", scope: !658, file: !181, line: 275, baseType: !29, size: 64, offset: 23296)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "abmon_5", scope: !658, file: !181, line: 276, baseType: !29, size: 64, offset: 23360)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "abmon_6", scope: !658, file: !181, line: 277, baseType: !29, size: 64, offset: 23424)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "abmon_7", scope: !658, file: !181, line: 278, baseType: !29, size: 64, offset: 23488)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "abmon_8", scope: !658, file: !181, line: 279, baseType: !29, size: 64, offset: 23552)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "abmon_9", scope: !658, file: !181, line: 280, baseType: !29, size: 64, offset: 23616)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "abmon_10", scope: !658, file: !181, line: 281, baseType: !29, size: 64, offset: 23680)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "abmon_11", scope: !658, file: !181, line: 282, baseType: !29, size: 64, offset: 23744)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "abmon_12", scope: !658, file: !181, line: 283, baseType: !29, size: 64, offset: 23808)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "mon_1", scope: !658, file: !181, line: 285, baseType: !29, size: 64, offset: 23872)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "mon_2", scope: !658, file: !181, line: 286, baseType: !29, size: 64, offset: 23936)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "mon_3", scope: !658, file: !181, line: 287, baseType: !29, size: 64, offset: 24000)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "mon_4", scope: !658, file: !181, line: 288, baseType: !29, size: 64, offset: 24064)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "mon_5", scope: !658, file: !181, line: 289, baseType: !29, size: 64, offset: 24128)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "mon_6", scope: !658, file: !181, line: 290, baseType: !29, size: 64, offset: 24192)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "mon_7", scope: !658, file: !181, line: 291, baseType: !29, size: 64, offset: 24256)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "mon_8", scope: !658, file: !181, line: 292, baseType: !29, size: 64, offset: 24320)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "mon_9", scope: !658, file: !181, line: 293, baseType: !29, size: 64, offset: 24384)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "mon_10", scope: !658, file: !181, line: 294, baseType: !29, size: 64, offset: 24448)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "mon_11", scope: !658, file: !181, line: 295, baseType: !29, size: 64, offset: 24512)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "mon_12", scope: !658, file: !181, line: 296, baseType: !29, size: 64, offset: 24576)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "am_str", scope: !658, file: !181, line: 298, baseType: !29, size: 64, offset: 24640)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "pm_str", scope: !658, file: !181, line: 299, baseType: !29, size: 64, offset: 24704)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "d_t_fmt", scope: !658, file: !181, line: 301, baseType: !29, size: 64, offset: 24768)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "d_fmt", scope: !658, file: !181, line: 302, baseType: !29, size: 64, offset: 24832)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "t_fmt", scope: !658, file: !181, line: 303, baseType: !29, size: 64, offset: 24896)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "t_fmt_ampm", scope: !658, file: !181, line: 304, baseType: !29, size: 64, offset: 24960)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "era", scope: !658, file: !181, line: 305, baseType: !29, size: 64, offset: 25024)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "era_year", scope: !658, file: !181, line: 307, baseType: !29, size: 64, offset: 25088)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "era_d_fmt", scope: !658, file: !181, line: 308, baseType: !29, size: 64, offset: 25152)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "alt_digits", scope: !658, file: !181, line: 309, baseType: !29, size: 64, offset: 25216)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "era_d_t_fmt", scope: !658, file: !181, line: 310, baseType: !29, size: 64, offset: 25280)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "era_t_fmt", scope: !658, file: !181, line: 311, baseType: !29, size: 64, offset: 25344)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "yesexpr", scope: !658, file: !181, line: 316, baseType: !29, size: 64, offset: 25408)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "noexpr", scope: !658, file: !181, line: 317, baseType: !29, size: 64, offset: 25472)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "yesstr", scope: !658, file: !181, line: 318, baseType: !29, size: 64, offset: 25536)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "nostr", scope: !658, file: !181, line: 319, baseType: !29, size: 64, offset: 25600)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "collate", scope: !658, file: !181, line: 322, baseType: !779, size: 896, offset: 25664)
!779 = !DIDerivedType(tag: DW_TAG_typedef, name: "__collate_t", file: !181, line: 149, baseType: !780)
!780 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !181, line: 111, size: 896, elements: !781)
!781 = !{!782, !783, !784, !785, !786, !787, !788, !789, !790, !791, !792, !793, !794, !795, !796, !797, !798, !799, !800, !801, !802, !803, !804, !805, !806, !807}
!782 = !DIDerivedType(tag: DW_TAG_member, name: "num_weights", scope: !780, file: !181, line: 112, baseType: !207, size: 16)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "num_starters", scope: !780, file: !181, line: 113, baseType: !207, size: 16, offset: 16)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "ii_shift", scope: !780, file: !181, line: 114, baseType: !207, size: 16, offset: 32)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "ti_shift", scope: !780, file: !181, line: 115, baseType: !207, size: 16, offset: 48)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "ii_len", scope: !780, file: !181, line: 116, baseType: !207, size: 16, offset: 64)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "ti_len", scope: !780, file: !181, line: 117, baseType: !207, size: 16, offset: 80)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "max_weight", scope: !780, file: !181, line: 118, baseType: !207, size: 16, offset: 96)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "num_col_base", scope: !780, file: !181, line: 119, baseType: !207, size: 16, offset: 112)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "max_col_index", scope: !780, file: !181, line: 120, baseType: !207, size: 16, offset: 128)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "undefined_idx", scope: !780, file: !181, line: 121, baseType: !207, size: 16, offset: 144)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "range_low", scope: !780, file: !181, line: 122, baseType: !207, size: 16, offset: 160)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "range_count", scope: !780, file: !181, line: 123, baseType: !207, size: 16, offset: 176)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "range_base_weight", scope: !780, file: !181, line: 124, baseType: !207, size: 16, offset: 192)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "range_rule_offset", scope: !780, file: !181, line: 125, baseType: !207, size: 16, offset: 208)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "ii_mask", scope: !780, file: !181, line: 127, baseType: !207, size: 16, offset: 224)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "ti_mask", scope: !780, file: !181, line: 128, baseType: !207, size: 16, offset: 240)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "index2weight_tbl", scope: !780, file: !181, line: 130, baseType: !205, size: 64, offset: 256)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "index2ruleidx_tbl", scope: !780, file: !181, line: 131, baseType: !205, size: 64, offset: 320)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "multistart_tbl", scope: !780, file: !181, line: 132, baseType: !205, size: 64, offset: 384)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "wcs2colidt_tbl", scope: !780, file: !181, line: 135, baseType: !205, size: 64, offset: 448)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "overrides_tbl", scope: !780, file: !181, line: 138, baseType: !205, size: 64, offset: 512)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "weightstr", scope: !780, file: !181, line: 141, baseType: !205, size: 64, offset: 576)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "ruletable", scope: !780, file: !181, line: 142, baseType: !205, size: 64, offset: 640)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "index2weight", scope: !780, file: !181, line: 145, baseType: !436, size: 64, offset: 704)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "index2ruleidx", scope: !780, file: !181, line: 146, baseType: !436, size: 64, offset: 768)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "MAX_WEIGHTS", scope: !780, file: !181, line: 148, baseType: !207, size: 16, offset: 832)
!808 = !DICompositeType(tag: DW_TAG_array_type, baseType: !29, size: 256, elements: !643)
!809 = !DIGlobalVariableExpression(var: !810, expr: !DIExpression())
!810 = distinct !DIGlobalVariable(name: "utf8", scope: !647, file: !212, line: 1094, type: !443, isLocal: true, isDefinition: true)
!811 = !DIGlobalVariableExpression(var: !812, expr: !DIExpression())
!812 = distinct !DIGlobalVariable(name: "__exe_env", scope: !813, file: !818, line: 34, type: !865, isLocal: false, isDefinition: true)
!813 = distinct !DICompileUnit(language: DW_LANG_C89, file: !814, producer: "Debian clang version 13.0.1-11+b2", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, globals: !815, splitDebugInlining: false, nameTableKind: None)
!814 = !DIFile(filename: "/home/aleksandar/Desktop/klee_project/2023_VLC-Media-Player_KLEE/klee/runtime/POSIX/fd_init.c", directory: "/home/aleksandar/Desktop/klee_project/2023_VLC-Media-Player_KLEE/klee/build/runtime/POSIX")
!815 = !{!811, !816}
!816 = !DIGlobalVariableExpression(var: !817, expr: !DIExpression())
!817 = distinct !DIGlobalVariable(name: "__exe_fs", scope: !813, file: !818, line: 21, type: !819, isLocal: false, isDefinition: true)
!818 = !DIFile(filename: "runtime/POSIX/fd_init.c", directory: "/home/aleksandar/Desktop/klee_project/2023_VLC-Media-Player_KLEE/klee")
!819 = !DIDerivedType(tag: DW_TAG_typedef, name: "exe_file_system_t", file: !61, line: 86, baseType: !820)
!820 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !61, line: 74, size: 832, elements: !821)
!821 = !{!822, !823, !854, !855, !856, !857, !858, !859, !860, !861, !862, !863, !864}
!822 = !DIDerivedType(tag: DW_TAG_member, name: "n_sym_files", scope: !820, file: !61, line: 75, baseType: !62, size: 32)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "sym_stdin", scope: !820, file: !61, line: 76, baseType: !824, size: 64, offset: 64)
!824 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !825, size: 64)
!825 = !DIDerivedType(tag: DW_TAG_typedef, name: "exe_disk_file_t", file: !61, line: 56, baseType: !826)
!826 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !61, line: 52, size: 192, elements: !827)
!827 = !{!828, !829, !830}
!828 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !826, file: !61, line: 53, baseType: !62, size: 32)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "contents", scope: !826, file: !61, line: 54, baseType: !7, size: 64, offset: 64)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "stat", scope: !826, file: !61, line: 55, baseType: !831, size: 64, offset: 128)
!831 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !832, size: 64)
!832 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat64", file: !103, line: 103, size: 1152, elements: !833)
!833 = !{!834, !835, !836, !837, !838, !839, !840, !841, !842, !843, !844, !846, !851, !852, !853}
!834 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !832, file: !103, line: 108, baseType: !106, size: 64)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !832, file: !103, line: 110, baseType: !91, size: 64, offset: 64)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !832, file: !103, line: 111, baseType: !110, size: 64, offset: 128)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !832, file: !103, line: 112, baseType: !112, size: 32, offset: 192)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !832, file: !103, line: 119, baseType: !114, size: 32, offset: 224)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !832, file: !103, line: 120, baseType: !116, size: 32, offset: 256)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !832, file: !103, line: 122, baseType: !45, size: 32, offset: 288)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !832, file: !103, line: 123, baseType: !106, size: 64, offset: 320)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !832, file: !103, line: 124, baseType: !120, size: 64, offset: 384)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !832, file: !103, line: 130, baseType: !122, size: 64, offset: 448)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !832, file: !103, line: 131, baseType: !845, size: 64, offset: 512)
!845 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt64_t", file: !85, line: 181, baseType: !81)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !832, file: !103, line: 139, baseType: !847, size: 128, offset: 576)
!847 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !127, line: 11, size: 128, elements: !848)
!848 = !{!849, !850}
!849 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !847, file: !127, line: 16, baseType: !130, size: 64)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !847, file: !127, line: 21, baseType: !132, size: 64, offset: 64)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !832, file: !103, line: 140, baseType: !847, size: 128, offset: 704)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !832, file: !103, line: 141, baseType: !847, size: 128, offset: 832)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !832, file: !103, line: 151, baseType: !136, size: 192, offset: 960)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "sym_stdout", scope: !820, file: !61, line: 76, baseType: !824, size: 64, offset: 128)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "stdout_writes", scope: !820, file: !61, line: 77, baseType: !62, size: 32, offset: 192)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "sym_files", scope: !820, file: !61, line: 78, baseType: !824, size: 64, offset: 256)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "max_failures", scope: !820, file: !61, line: 81, baseType: !62, size: 32, offset: 320)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "read_fail", scope: !820, file: !61, line: 84, baseType: !551, size: 64, offset: 384)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "write_fail", scope: !820, file: !61, line: 84, baseType: !551, size: 64, offset: 448)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "close_fail", scope: !820, file: !61, line: 84, baseType: !551, size: 64, offset: 512)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "ftruncate_fail", scope: !820, file: !61, line: 84, baseType: !551, size: 64, offset: 576)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "getcwd_fail", scope: !820, file: !61, line: 84, baseType: !551, size: 64, offset: 640)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "chmod_fail", scope: !820, file: !61, line: 85, baseType: !551, size: 64, offset: 704)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "fchmod_fail", scope: !820, file: !61, line: 85, baseType: !551, size: 64, offset: 768)
!865 = !DIDerivedType(tag: DW_TAG_typedef, name: "exe_sym_env_t", file: !61, line: 100, baseType: !866)
!866 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !61, line: 93, size: 6208, elements: !867)
!867 = !{!868, !879, !880}
!868 = !DIDerivedType(tag: DW_TAG_member, name: "fds", scope: !866, file: !61, line: 94, baseType: !869, size: 6144)
!869 = !DICompositeType(tag: DW_TAG_array_type, baseType: !870, size: 6144, elements: !877)
!870 = !DIDerivedType(tag: DW_TAG_typedef, name: "exe_file_t", file: !61, line: 72, baseType: !871)
!871 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !61, line: 65, size: 192, elements: !872)
!872 = !{!873, !874, !875, !876}
!873 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !871, file: !61, line: 66, baseType: !45, size: 32)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !871, file: !61, line: 67, baseType: !62, size: 32, offset: 32)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "off", scope: !871, file: !61, line: 70, baseType: !82, size: 64, offset: 64)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "dfile", scope: !871, file: !61, line: 71, baseType: !824, size: 64, offset: 128)
!877 = !{!878}
!878 = !DISubrange(count: 32)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "umask", scope: !866, file: !61, line: 95, baseType: !159, size: 32, offset: 6144)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "save_all_writes", scope: !866, file: !61, line: 99, baseType: !45, size: 32, offset: 6176)
!881 = !DIGlobalVariableExpression(var: !882, expr: !DIExpression())
